ubports-mako.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-28 Thu 19:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>installing ubports on mako</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<nav>
<a href="index.html">home</a> /
<a href="about.html">about</a> /
<a href="sitemap.html">sitemap</a> /
</nav>
</head>
<body>
<div id="content" class="content">
<h1 class="title">installing ubports on mako</h1>
<p>
ubuntu touch is a failed and abandoned attempt by canonical to make a
phone linux distro. ubports is an attempt to continue it.
</p>

<p>
this guide explains how to install it without the annoying electron
autoinstaller i was unable to get working.
</p>

<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org0000000">1. requirements</a></li>
<li><a href="#org0000001">2. choose a channel</a></li>
<li><a href="#org0000002">3. time to flash</a></li>
<li><a href="#org0000003">4. wait a bit</a></li>
<li><a href="#org0000004">5. troubleshooting</a>
<ul>
<li><a href="#org0000005">5.1. getting sent back to recovery</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org0000000" class="outline-2">
<h2 id="org0000000"><span class="section-number-2">1.</span> requirements</h2>
<div class="outline-text-2" id="text-1">
<p>
you will need <code>ubuntu-device-flash</code>. it is on the aur if using <a href="./pacman.html">arch</a>
</p>
</div>
</div>

<div id="outline-container-org0000001" class="outline-2">
<h2 id="org0000001"><span class="section-number-2">2.</span> choose a channel</h2>
<div class="outline-text-2" id="text-2">
<p>
<a href="https://system-image.ubports.com/ubports-touch/16.04/">https://system-image.ubports.com/ubports-touch/16.04/</a> has a list of
channels.
</p>

<p>
at the time of writing, <code>devel</code> <code>edge</code> <code>rc</code> (release candidate) and
<code>stable</code> are the options to choose from.
</p>

<p>
<span class="timestamp-wrapper"><span class="timestamp">[2023-01-01 Sun]</span></span>: happy new years! yes, it is twenty twenty three, and
the version (which ubuntu bases on year dot month) is still
"16.04"&#x2026; i do hope the ubports people updated the kernel at least.
</p>
</div>
</div>

<div id="outline-container-org0000002" class="outline-2">
<h2 id="org0000002"><span class="section-number-2">3.</span> time to flash</h2>
<div class="outline-text-2" id="text-3">
<p>
boot into your bootloader, then you can run
</p>

<pre class="example" id="org0000006">
ubuntu-device-flash touch --server https://system-image.ubports.com --channel ubports-touch/16.04/&lt;your channel&gt; --bootstrap 
</pre>

<p>
replacing <code>&lt;your channel&gt;</code> with the channel you chose, for example <code>rc</code>
</p>
</div>
</div>

<div id="outline-container-org0000003" class="outline-2">
<h2 id="org0000003"><span class="section-number-2">4.</span> wait a bit</h2>
<div class="outline-text-2" id="text-4">
<p>
you should see an animation with orange dots
</p>

<p>
now it hopefully is installed! if not&#x2026;
</p>
</div>
</div>

<div id="outline-container-org0000004" class="outline-2">
<h2 id="org0000004"><span class="section-number-2">5.</span> troubleshooting</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org0000005" class="outline-3">
<h3 id="org0000005"><span class="section-number-3">5.1.</span> getting sent back to recovery</h3>
<div class="outline-text-3" id="text-5-1">
<p>
if it boots you back to recovery when trying to flash, you may need to
increase your cache partition size
</p>
</div>
</div>
</div>
</div>
</body>
</html>
